package volosyuk.easybizcard.utils;

import com.blongho.country_data.Country;
import com.blongho.country_data.World;

import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class CountryManager {

    // Получаем все страны
    public static List<Country> getCountries() {
        return World.getAllCountries();  // Возвращаем список стран
    }

    public static final Map<String, String> PHONE_CODES = new HashMap<String, String>() {{
        put("AD", "+376");   // Андорра
        put("AE", "+971");   // Объединенные Арабские Эмираты
        put("AF", "+93");    // Афганистан
        put("AG", "+1-268"); // Антигуа и Барбуда
        put("AI", "+1-264"); // Ангилья
        put("AL", "+355");   // Албания
        put("AM", "+374");   // Армения
        put("AO", "+244");   // Ангола
        put("AQ", "+672");   // Антарктида
        put("AR", "+54");    // Аргентина
        put("AS", "+1-684"); // Американское Самоа
        put("AT", "+43");    // Австрия
        put("AU", "+61");    // Австралия
        put("AW", "+297");   // Аруба
        put("AX", "+358");   // Аландские острова
        put("AZ", "+994");   // Азербайджан
        put("BA", "+387");   // Босния и Герцеговина
        put("BB", "+1-246"); // Барбадос
        put("BD", "+880");   // Бангладеш
        put("BE", "+32");    // Бельгия
        put("BF", "+226");   // Буркина-Фасо
        put("BG", "+359");   // Болгария
        put("BH", "+973");   // Бахрейн
        put("BI", "+257");   // Бурунди
        put("BJ", "+229");   // Бенин
        put("BL", "+590");   // Сен-Бартелеми
        put("BM", "+1-441"); // Бермудские острова
        put("BN", "+673");   // Бруней
        put("BO", "+591");   // Боливия
        put("BQ", "+599");   // Бонэйр, Синт-Эстатиус и Саба
        put("BR", "+55");    // Бразилия
        put("BS", "+1-242"); // Багамы
        put("BT", "+975");   // Бутан
        put("BV", "+47");    // Остров Буве
        put("BW", "+267");   // Ботсвана
        put("BY", "+375");   // Беларусь
        put("BZ", "+501");   // Белиз
        put("CA", "+1");     // Канада
        put("CC", "+61");    // Кокосовые острова
        put("CD", "+243");   // Демократическая Республика Конго
        put("CF", "+236");   // Центральноафриканская Республика
        put("CG", "+242");   // Конго
        put("CH", "+41");    // Швейцария
        put("CI", "+225");   // Кот-д’Ивуар
        put("CK", "+682");   // Острова Кука
        put("CL", "+56");    // Чили
        put("CM", "+237");   // Камерун
        put("CN", "+86");    // Китай
        put("CO", "+57");    // Колумбия
        put("CR", "+506");   // Коста-Рика
        put("CU", "+53");    // Куба
        put("CV", "+238");   // Кабо-Верде
        put("CW", "+599");   // Кюрасао
        put("CX", "+61");    // Остров Рождества
        put("CY", "+357");   // Кипр
        put("CZ", "+420");   // Чехия
        put("DE", "+49");    // Германия
        put("DJ", "+253");   // Джибути
        put("DK", "+45");    // Дания
        put("DM", "+1-767"); // Доминика
        put("DO", "+1-809"); // Доминиканская Республика
        put("DZ", "+213");   // Алжир
        put("EC", "+593");   // Эквадор
        put("EE", "+372");   // Эстония
        put("EG", "+20");    // Египет
        put("EH", "+212");   // Западная Сахара
        put("ER", "+291");   // Эритрея
        put("ES", "+34");    // Испания
        put("ET", "+251");   // Эфиопия
        put("FI", "+358");   // Финляндия
        put("FJ", "+679");   // Фиджи
        put("FM", "+691");   // Федеративные Штаты Микронезии
        put("FO", "+298");   // Фарерские острова
        put("FR", "+33");    // Франция
        put("GA", "+241");   // Габон
        put("GB", "+44");    // Великобритания
        put("GD", "+1-473"); // Гренада
        put("GE", "+995");   // Грузия
        put("GF", "+594");   // Французская Гвиана
        put("GG", "+44");    // Гернси
        put("GH", "+233");   // Гана
        put("GI", "+350");   // Гибралтар
        put("GL", "+299");   // Гренландия
        put("GM", "+220");   // Гамбия
        put("GN", "+224");   // Гвинея
        put("GP", "+590");   // Гваделупа
        put("GQ", "+240");   // Экваториальная Гвинея
        put("GR", "+30");    // Греция
        put("GT", "+502");   // Гватемала
        put("GU", "+1-671"); // Гуам
        put("GW", "+245");   // Гвинея-Бисау
        put("GY", "+592");   // Гайана
        put("HK", "+852");   // Гонконг
        put("HM", "+672");   // Остров Херд и острова Макдональд
        put("HN", "+504");   // Гондурас
        put("HR", "+385");   // Хорватия
        put("HT", "+509");   // Гаити
        put("HU", "+36");    // Венгрия
        put("ID", "+62");    // Индонезия
        put("IE", "+353");   // Ирландия
        put("IL", "+972");   // Израиль
        put("IM", "+44");    // Остров Мэн
        put("IN", "+91");    // Индия
        put("IO", "+246");   // Британская территория в Индийском океане
        put("IQ", "+964");   // Ирак
        put("IR", "+98");    // Иран
        put("IS", "+354");   // Исландия
        put("IT", "+39");    // Италия
        put("JE", "+44");    // Джерси
        put("JM", "+1-876"); // Ямайка
        put("JO", "+962");   // Иордания
        put("JP", "+81");    // Япония
        put("XK", "+383");  // Косово
        put("KG", "+996");  // Кыргызстан
        put("LV", "+371");  // Латвия
        put("LI", "+423");  // Лихтенштейн
        put("MG", "+261");  // Мадагаскар
        put("LU", "+352");  // Люксембург
        put("LT", "+370");  // Литва
        put("ZW", "+263");  // Зимбабве
        put("ZM", "+260");  // Замбия
        put("YE", "+967");  // Йемен
        put("VN", "+84");   // Вьетнам
        put("VE", "+58");   // Венесуэла
        put("VA", "+379");  // Ватикан
        put("VU", "+678");  // Вануату
        put("UZ", "+998");  // Узбекистан
        put("UY", "+598");  // Уругвай
        put("US", "+1");    // Соединённые Штаты
        put("UA", "+380");  // Украина
        put("UG", "+256");  // Уганда
        put("TR", "+90");   // Турция
        put("TN", "+216");  // Тунис
        put("TO", "+676");  // Тонга
        put("TK", "+690");  // Токелау
        put("TG", "+228");  // Того
        put("TL", "+670");  // Восточный Тимор (Тимор-Лесте)
        put("TH", "+66");   // Таиланд
        put("TZ", "+255");  // Танзания
        put("TJ", "+992");  // Таджикистан
        put("TW", "+886");  // Тайвань
        put("ST", "+239");  // Сан-Томе и Принсипи
        put("SY", "+963");  // Сирия
        put("SE", "+46");   // Швеция
        put("SJ", "+47");   // Шпицберген и Ян-Майен
        put("SR", "+597");  // Суринам
        put("SD", "+249");  // Судан
        put("VC", "+1-784"); // Сент-Винсент и Гренадины
        put("KN", "+1-869"); // Сент-Китс и Невис
        put("LK", "+94");   // Шри-Ланка
        put("SS", "+211");  // Южный Судан
        put("KR", "+82");   // Южная Корея
        put("ZA", "+27");   // Южная Африка
        put("SO", "+252");  // Сомали
        put("SB", "+677");  // Соломоновы Острова
        put("SI", "+386");  // Словения
        put("SK", "+421");  // Словакия
        put("SX", "+1-721"); // Синт-Мартен
        put("SG", "+65");   // Сингапур
        put("SL", "+232");  // Сьерра-Леоне
        put("SC", "+248");  // Сейшелы
        put("CS", "+381");  // Сербия и Черногория (больше не существует как единое государство)
        put("RS", "+381");  // Сербия
        put("SN", "+221");  // Сенегал
        put("SA", "+966");  // Саудовская Аравия
        put("SM", "+378");  // Сан-Марино
        put("WS", "+685");  // Самоа
        put("PM", "+508");  // Сен-Пьер и Микелон
        put("LC", "+1-758"); // Сент-Люсия
        put("SH", "+290");  // Остров Святой Елены
        put("RE", "+262");  // Реюньон
        put("RW", "+250");  // Руанда
        put("RU", "+7");    // Россия
        put("RO", "+40");   // Румыния
        put("QA", "+974");  // Катар
        put("PR", "+1-787"); // Пуэрто-Рико
        put("PT", "+351");  // Португалия
        put("PL", "+48");   // Польша
        put("PW", "+680");  // Палау
        put("PS", "+970");  // Палестина
        put("PA", "+507");  // Панама
        put("PG", "+675");  // Папуа-Новая Гвинея
        put("PE", "+51");   // Перу
        put("PH", "+63");   // Филиппины
        put("PN", "+64");   // Острова Питкэрн
        put("PK", "+92");   // Пакистан
        put("OM", "+968");  // Оман
        put("NO", "+47");   // Норвегия
        put("MP", "+1-670"); // Северные Марианские Острова
        put("MK", "+389");  // Северная Македония
        put("KP", "+850");  // Северная Корея
        put("NF", "+672");  // Остров Норфолк
        put("NU", "+683");  // Ниуэ
        put("NG", "+234");  // Нигерия
        put("NE", "+227");  // Нигер
        put("NI", "+505");  // Никарагуа
        put("NZ", "+64");   // Новая Зеландия
        put("NL", "+31");   // Нидерланды
        put("NP", "+977");  // Непал
        put("NR", "+674");  // Науру
        put("NA", "+264");  // Намибия
        put("MM", "+95");   // Мьянма
        put("MZ", "+258");  // Мозамбик
        put("MA", "+212");  // Марокко
        put("MS", "+1-664"); // Монтсеррат
        put("ME", "+382");  // Черногория
        put("MN", "+976");  // Монголия
        put("MC", "+377");  // Монако
        put("MD", "+373");  // Молдова
        put("MX", "+52");   // Мексика
        put("YT", "+262");  // Майотта
        put("MU", "+230");  // Маврикий
        put("MR", "+222");  // Мавритания
        put("MQ", "+596");  // Мартиника
        put("MH", "+692");  // Маршалловы Острова
        put("MT", "+356");  // Мальта
        put("ML", "+223");  // Мали
        put("MV", "+960");  // Мальдивы
        put("MY", "+60");   // Малайзия
        put("MW", "+265");  // Малави
        put("LY", "+218");  // Ливия
        put("LR", "+231");  // Либерия
        put("LS", "+266");  // Лесото
        put("LB", "+961");  // Ливан
        put("LA", "+856");  // Лаос
        put("KI", "+686");  // Кирибати
        put("KZ", "+7");    // Казахстан
        put("TD", "+235");  // Чад
        put("KH", "+855");  // Камбоджа
        put("VG", "+1-284"); // Британские Виргинские Острова
    }};



}
